In [1]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

In [2]:
np.nan

nan

# NaN not a number

In [3]:
type(np.nan)

float

In [4]:
a=1
b=np.nan
c=a*b

In [5]:
c

nan

In [6]:
type(c)

float

# NaN in Series

In [9]:
s1 =Series([1,2,np.nan,np.nan], index=['A','B','C','D'])

In [10]:
s1

A    1.0
B    2.0
C    NaN
D    NaN
dtype: float64

In [11]:
s1.dropna()

A    1.0
B    2.0
dtype: float64

In [12]:
s1

A    1.0
B    2.0
C    NaN
D    NaN
dtype: float64

# NaN in DataFrame

In [15]:
df = DataFrame([[1,2,3],[4,np.nan,6],[7,np.nan,9]])

In [16]:
df

   0    1  2
0  1  2.0  3
1  4  NaN  6
2  7  NaN  9

In [17]:
df.isnull()

       0      1      2
0  False  False  False
1  False   True  False
2  False   True  False

In [18]:
df.dropna()

   0    1  2
0  1  2.0  3

In [19]:
df.dropna(how='all')
# how : {'any', 'all'}
#     * any : if any NA values are present, drop that label
#     * all : if all values are NA, drop that label

   0    1  2
0  1  2.0  3
1  4  NaN  6
2  7  NaN  9

In [21]:
df

   0    1  2
0  1  2.0  3
1  4  NaN  6
2  7  NaN  9

In [28]:
df.dropna(axis=0,how='any')

   0    1  2
0  1  2.0  3

In [20]:
df.dropna(axis=1,how='any')  #0 or 'index', 1 or 'columns'

   0  2
0  1  3
1  4  6
2  7  9

In [77]:
dfs = DataFrame([[1,2,3],[4,np.nan,np.nan],[7,np.nan,9],[np.nan,9,1]])

In [85]:
dfs

     0    1    2
0  1.0  2.0  3.0
1  4.0  NaN  NaN
2  7.0  NaN  9.0
3  NaN  9.0  1.0

In [84]:
dfs.fillna(value={1:500,0:2000,2:1000},axis=0)#选择值性填充，只能是columns纵向填充

        0      1       2
0     1.0    2.0     3.0
1     4.0  500.0  1000.0
2     7.0  500.0     9.0
3  2000.0    9.0     1.0

In [79]:
dfs

     0    1    2
0  1.0  2.0  3.0
1  4.0  NaN  NaN
2  7.0  NaN  9.0
3  NaN  9.0  1.0

In [80]:
dfs.fillna(value=500,limit=1)#用500代替，每列只能代替一个

       0      1      2
0    1.0    2.0    3.0
1    4.0  500.0  500.0
2    7.0    NaN    9.0
3  500.0    9.0    1.0

In [81]:
dff = pd.DataFrame({'Col1':[np.nan]*5,
                   'Col2':[1]*5,
                   'Col3':[2,np.nan,2,2,2],
                   'Col4':[3,np.nan,3,np.nan,3],
                   'Col5':[4,np.nan,np.nan,np.nan,4],
                   'Col6':[np.nan]*5,
                   'Col7':[np.nan]*5,
                   'Col8':[np.nan]*5})

In [82]:
dff

   Col1  Col2  Col3  Col4  Col5  Col6  Col7  Col8
0   NaN     1   2.0   3.0   4.0   NaN   NaN   NaN
1   NaN     1   NaN   NaN   NaN   NaN   NaN   NaN
2   NaN     1   2.0   3.0   NaN   NaN   NaN   NaN
3   NaN     1   2.0   NaN   NaN   NaN   NaN   NaN
4   NaN     1   2.0   3.0   4.0   NaN   NaN   NaN

In [61]:
dff.fillna(method='pad',limit=2)
#用前一个数字代替(bfill-用后一个数字代替），每列只能代替两个

   Col1  Col2  Col3  Col4  Col5  Col6  Col7  Col8
0   NaN     1   2.0   3.0   4.0   NaN   NaN   NaN
1   NaN     1   2.0   3.0   4.0   NaN   NaN   NaN
2   NaN     1   2.0   3.0   4.0   NaN   NaN   NaN
3   NaN     1   2.0   3.0   NaN   NaN   NaN   NaN
4   NaN     1   2.0   3.0   4.0   NaN   NaN   NaN